<?php
/*
 * @name error.php
 *
 * 错误码以及错误信息对照表
 * @rule
 *  1.1-9999 预保留
 *  2.10000-19999 用户类型错误
 *  3.20000-29999 参数类型错误
 *  4.30000-39999 权限类型错误
 *  5.40000-49999 系统类型错误
 *  6.50000-59999 自定义参数错误
 *  7.60000-69999
 *  8.70000-79999
 */

$config['error'][0] = '';
$config['error'][1] = '登录失效,请重新登录';
$config['error'][2] = '非法访问';
$config['error'][3] = '无访问权限';
$config['error'][4] = '参数错误';
$config['error'][5] = '暂无数据';
$config['error'][6] = '保存失败,请稍后再试';
$config['error'][7] = '账号不存在';

/* 10000-19999 用户类型错误 */

$config['error'][10000] = '账号不存在，请重新输入';

return $config;